package org.example.homeworks.homework2;
//2.Создайте класс Concatenation
//Создайте две переменные типа String
//Примените конкатенацию строк и выведите результат в консоль.
//Скомпилируйте созданную программу.
//Запустите программу в терминале.
public class Concatenation {
    public static void main(String[] args) {
        // Создаем две строки
        String str1 = "Hello";
        String str2 = "World!";

        // Конкатенируем строки
        String result = str1 + ", " + str2;

        // Выводим результат в консоль
        System.out.println(result);
    }
}
